Repository: bit-part/craftcms_docs-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: You can override their default values in your config/db.php file.
ja: config/db.php ファイルでデフォルト値を上書きすることができます。

source: You can override their default values in your config/general.php file.
ja: config/general.php ファイルでデフォルト値を上書きすることができます。

source: You can parse any string for reference tags in your templates using the `parseRefs` filter:
ja: `parseRefs` フィルタを利用して、テンプレート内のリファレンスタグの文字列を解析できます。

source: You can parse any string for reference tags in your templates using the parseRefs filter:
ja: parseRefs フィルタを利用して、テンプレート内のリファレンスタグの文字列を解析できます。

source: You can pass 'or' instead if you want any of the relation criteria to match.
ja: リレーション基準のいずれかとマッチさせたい場合、'or' を渡すことができます。

source: You can pass multiple block types if you want:
ja: あなたが望むなら、複数のブロックタイプを渡すことができます。

source: You can pass them into functions, manipulate them, and output them.
ja: それらをファンクションに渡したり、操作したり、出力することができます。

source: You can perform the following actions from the Edit Entry page:
ja: エントリの編集ページでは、次のアクションを実行できます。

source: You can place this tag anywhere in your template, including within a conditional.
ja: 条件文の中を含め、テンプレートのどこにでもこのタグを記述できます。

source: You can press Command+Shift+. to toggle hidden file visibility in Finder.
ja: Finder で Command + Shift + . を押すことで、不可視ファイルの表示を切り替えることができます。

source: You can put just about anything inside them – as long as Twig can evaluate it into a string.
ja: Twig が文字列として評価できるものであれば、その中にほぼ何でも記述できます。

source: You can refer to the element types’ class references for a list of available properties:
ja: 利用可能なプロパティのリストは、エレメントタイプのクラスリファレンスを参照してください。

source: You can reference the entry’s properties in two ways:
ja: エントリの プロパティ は、次の2つの方法で参照できます。

source: You can reorder, delete, and add new rows, and modify their values.
ja: 並び替えや削除、新しい行の追加、値の変更ができます。

source: You can replace multiple things at once by passing in an object of search/replace pairs:
ja: ペアの検索 / 置換のオブジェクトを渡すことで、一度に複数のものを置き換えることができます。

source: You can run all of the updates (Craft, all plugin updates available) using the Update All button at the top left of the Updates page.
ja: アップデートページの左上にある「すべてを更新」ボタンを使用して、（アップデート可能な Craft とプラグイン）すべてのアップデートを実行できます。

source: You can search for elements anywhere you see this bar:
ja: このバーが表示されている場所ならどこでも、エレメントを検索できます。

source: You can set this to a locale ID.
ja: ロケール ID をここにセットします。

source: You can set this to either a field handle or a field ID (or an array of handles and/or IDs).
ja: フィールドハンドルかフィールド ID のいずれか（もしくは、ハンドル、および / または、ID の配列）をセットできます。

source: You can set up your asset volumes from Settings → Assets.
ja: アセットボリュームは「設定 > アセット」から設定することができます。

source: You can solve this with eager-loading, using the with criteria parameter.
ja: 判定基準のパラメータ with を利用した eager-loading によって、これを解決することができます。

source: You can specify the search query in two different ways:
ja: 検索クエリは、次の2つの方法で指定できます。

source: You can specify where the tag should be added to the page using one of these position keywords:
ja: 次の位置キーワードのいずれかを使用して、ページの を追加する場所を指定できます。

source: You can test whether you set everything up correctly by pointing your web browser to http:///index.php?p=admin (substituting with your web server’s host name).
ja: プラウザで http:///index.php?p=admin（新しいウェブサーバーのホスト名で を置き換える）にアクセスすることで、すべて正しく設定できたかどうかをテストできます。

source: You can test whether you set everything up correctly by pointing your web browser to http://HOSTNAME/index.php?p=admin (substituting HOSTNAME with your new web server’s host name).
ja: ブラウザで http://HOSTNAME/index.php?p=admin（新しいウェブサーバーのホスト名でHOSTNAME を置き換える）にアクセスすることで、すべて正しく設定できたかどうかをテストできます。

source: You can think of a template as a HTML document.
ja: テンプレートは HTML ドキュメントだと考えることができます。

source: You can toggle hidden file visibility in Finder by pressing Command + Shift + . (period).
ja: Finder で Command + Shift + .（ピリオド）を押すことで、不可視ファイルの表示を切り替えることができます。

source: You can use Twig filters in both syntaxes:
ja: いずれの構文でも Twig フィルタを使えます。

source: You can use this in a conditional:
ja: これを条件文で使えます。

source: You can use your own HTML/CSS/JS layout.
ja: 独自の HTML / CSS / JS レイアウトを利用できます。

source: You can’t use them outside of top-level {% block %} tags within a template that extends another.
ja: 他を拡張するテンプレート内で、トップレベルの {% block %} タグの外側で使用することはできません。

source: You create those relationships using relational field types.
ja: 関連フィールドタイプを利用して、それらの関連性を作成します。

source: You don’t need to know PHP or Yii to use it unless you intend to write your own plugins.
ja: 独自のプラグインを作成するつもりがなければ、PHP や Yii の知識は必要ありません。

source: You even get to set the option values and labels separately, and choose which one should be selected by default.
ja: オプションの値とラベルを別々に設定したり、デフォルトで選択状態にしておくものを選択できます。

source: You even get to set the option values and labels separately, and choose which ones should be checked by default.
ja: オプションの値とラベルを別々に設定したり、デフォルトでチェックしておくものを選択できます。

source: You manage the multi-site content at the entry level, with the ability to enable Sections you want included in a site.
ja: サイトに含めたいセクションだけを有効化できる能力により、エントリレベルでマルチサイトのコンテンツを管理します。

source: You need to prefix your relational field’s handle with the block type’s handle:
ja: 関連フィールドのハンドルの前に、ブロックタイプのハンドルを付ける必要があります。

source: You should be running Composer 1.3.0 or later.
ja: Composer 1.3.0 以降を稼働させるべきです。

source: You should use {% cache %} tags any time you’ve got a template that’s causing a lot of database queries, or you’re doing something very computationally expensive with Twig.
ja: 沢山のデータベースクエリを引き起こすテンプレートがある場合、または Twig の計算上非常にコストがかかる処理を行っているときは、{% cache %} タグを使うべきです。

source: You specify the actual header that should be set by typing it as a string after the word header.
ja: header の後に文字列として記述することによって、実際のヘッダーを明示します。

source: You store the site-specific templates in each site template directory.
ja: それぞれのサイトのテンプレートディレクトリに、サイト固有のテンプレートを格納します。

source: You will be using this variable name to reference the items inside the loop.
ja: この変数名を利用して、ループ内のアイテムを参照します。

source: You will either need to assign the tag a new key, or clear your existing template caches manually using the Clear Caches tool in Settings.
ja: タグに新しいキーを割り当てるか、「設定」の「キャッシュをクリア」ツールを使用して既存のテンプレートキャッシュを手動でクリアする必要があります。

source: You will use the Site Handle to refer to this site in the templates.
ja: テンプレート内でこのサイトを参照するために、サイトハンドルを利用します。

source: You'll want to sign up with Disqus and get your Universal Code on Disqus’ site in Admin → Settings → Install.
ja: あなたは Disqus にサインアップし、Disqus のサイトの「Admin → Settings → Install」からユニバーサルコードを入手できるでしょう。

source: Your web/index.php file can specify a few PHP constants, which Craft’s bootstrap script will check for while loading and configuring Craft.
ja: web/index.php ファイルは、Craft の読み込みと環境設定を行なう際に、Craft の起動スクリプトがチェックするいくつかの PHP 定数を指定することができます。

source: Your caches will automatically clear when any elements (entries, assets, etc.) within the tags are saved or deleted.
ja: タグ内のエレメント（エントリ、アセットなど）が保存または削除されると、キャッシュは自動的にクリアされます。

source: Your front-end s and JS scripts that submit to a controller action will need to be updated with the following changes.
ja: コントローラーアクションに送信するフロントエンドの や JavaScript は、次の変更を加えてアップデートする必要があります。

source: Your front-end templates go in here.
ja: フロントエンド向けのテンプレートをここにまとめます。

source: Zero-based offset from where the records are to be returned
ja: レコードが返される場所からのゼロベースのオフセット

source: [`craftcms/cms`] – This is the Composer package that contains all of Craft’s source code.
ja: [`craftcms/cms`] – Craft のすべてのソースコードを含む Composer パッケージです。

source: [`craftcms/craft`] – This is a Composer “project” that can be used as a starting point for new Craft projects.
ja: [`craftcms/craft`] – 新しい Craft プロジェクトのスタート地点として使うことができる Composer 「プロジェクト」です。

source: _or_
ja: _または_

source: `action` Params
ja: `action` パラメータ

source: `mustShowScriptName` – If this is set to true, then the URL returned will include “index.php”, disregarding the config setting.
ja: `mustShowScriptName` – ここに true がセットされている場合、「index.php」を含めた URL が返され、コンフィグ設定の は無視されます。

source: `mustShowScriptName` – If this is set to true, then the URL returned will include “index.php”, disregarding the omitScriptNameInUrls config setting.
ja: `mustShowScriptName` – ここに true がセットされている場合、「index.php」を含めた URL が返され、コンフィグ設定の omitScriptNameInUrls は無視されます。

source: `omitScriptNameInUrls` and `usePathInfo`
ja: `omitScriptNameInUrls` と `usePathInfo`

source: `pageInfo.currentPage` – The current page number.
ja: `pageInfo.currentPage` – 現在のページ番号。

source: `pageInfo.firstUrl` – The URL to the first page.
ja: `pageInfo.firstUrl` – 最初のページの URL。

source: `pageInfo.first` – The offset of the first element on the current page.
ja: `pageInfo.first` – 現在のページの最初のエレメントのオフセット。

source: `pageInfo.getNextUrls( [dist] )` – Returns an array of URLs to the next pages, with keys set to the page numbers.
ja: `pageInfo.getNextUrls( [dist] )` – キーにページ番号がセットされた、次のページの URL の配列を返します。

source: `pageInfo.getPageUrl( page )` – Returns the URL to a given page number, or null if the page doesn’t exist.
ja: `pageInfo.getPageUrl( page )` – 指定されたページ番号の URL、または、ページが存在しない場合は null を返します。

source: `pageInfo.getPrevUrls( [dist] )` – Returns an array of URLs to the previous pages, with keys set to the page numbers.
ja: `pageInfo.getPrevUrls( [dist] )` – キーにページ番号がセットされた、前のページの URL の配列を返します。

source: `pageInfo.getRangeUrls( start, end )` – Returns an array of URLs to pages in a given range of page numbers, with keys set to the page numbers.
ja: `pageInfo.getRangeUrls( start, end )` – キーにページ番号がセットされた、指定したページ番号の範囲のページ URL の配列を返します。

source: `pageInfo.lastUrl` – The URL to the last page.
ja: `pageInfo.lastUrl` – 最後のページの URL。

source: `pageInfo.last` – The offset of the last element on the current page.
ja: `pageInfo.last` – 現在のページの最後のエレメントのオフセット。

source: `pageInfo.nextUrl` – The URL to the next page, or null if you’re on the last page.
ja: `pageInfo.nextUrl` – 次のページの URL、または、最後のページにいる場合は null。

source: `pageInfo.prevUrl` – The URL to the previous page, or null if you’re on the first page.
ja: `pageInfo.prevUrl` – 前のページの URL、または、最初のページにいる場合は null。

source: `pageInfo.totalPages` – The total number of pages.
ja: `pageInfo.totalPages` – すべてのページ数。

source: `pageInfo.total` – The total number of elements across all pages
ja: `pageInfo.total` – すべてのページのエレメントの合計数。

source: `params` – Any query string parameters that should be appended to the URL.
ja: `params` – URL に追加するクエリ文字列パラメータ。

source: `path` – The path that the resulting URL should point to on your site.
ja: `path` – 結果となる URL がサイトで指すべきパス。

source: `protocol` – Which protocol the URL should use ('http' or 'https').
ja: `protocol` – URL が使用するプロトコル（'http' または 'https'）。

source: `redirect` Params
ja: `redirect` パラメータ

source: `sanitize` – Whether the SVG should be sanitized of any potentially malicious scripts (true by default).
ja: `sanitize` – SVG が潜在的な悪意あるスクリプトのサニタイズをされるべきかどうか（デフォルトは true）。

source: `svg` – The SVG file path, an SVG file’s contents, or an object that represents an SVG file.
ja: `svg` – SVG ファイルパス、SVG ファイルのコンテンツ、または SVG ファイルに相当する オブジェクト。

source: `svg` – The SVG file path, or an SVG file’s contents.
ja: `svg` – SVG ファイルのパス、または SVG ファイルのコンテンツ

source: `unless` in a single {% cache %} tag.
ja: `unless` のいずれかを1つの {% cache %} タグで使用できます。

source: `until` in a single {% cache %} tag.
ja: `until` のいずれかを1つの {% cache %} タグで使用できます。

source: a Blog
ja: ブログ

source: a Contact Us page
ja: お問い合わせページ

source: a News section
ja: ニュースのセクション

source: a Services section, where the order of services matters
ja: サービスの順序が重要なサービスのセクション

source: a company organization chart
ja: 会社の組織図

source: action Params
ja: action パラメータ

source: action params must be rewritten in in kebab-case rather than camelCase.
ja: action パラメータは camelCase ではなく kebab-case に書き換えなければなりません。

source: an About Us page
ja: 会社概要ページ

source: and add this line:
ja: 次の行を追加します。

source: and
ja: と

source: assets/ – Stores image thumbnails, resized file icons, and copies of images stored on remote asset sources, to save Craft an HTTP request when it needs the images to generate new thumbnails or transforms.
ja: assets/ – 新しいサムネイルやトランスフォームの生成にあたり画像が必要なときに Craft の HTTP リクエストを節約する目的で、画像サムネイル、リサイズされたファイルのアイコン、リモートアセットソースに保存された画像のコピーを格納します。

source: assets/ – Stores image thumbnails, resized file icons, and copies of images stored on remote asset volumes, to save Craft an HTTP request when it needs the images to generate new thumbnails or transforms.
ja: assets/ – 新しいサムネイルやトランスフォームの生成にあたり画像が必要なときに Craft の HTTP リクエストを節約する目的で、画像サムネイル、リサイズされたファイルのアイコン、リモートアセットボリュームに保存された画像のコピーを格納します。

source: average() – Returns the average number of all the values in the first column
ja: average() – 最初のカラムのすべての値の平均値を返します

source: backups/ – Stores database backups that get created when you update Craft or run the DB Backup utility.
ja: backups/ – Craft のアップデートやデータベースバックアップユーティリティの実行時に生成される、データベースのバックアップを格納します。

source: basePath – The base path to your plugin’s source files.
ja: basePath – プラグインのソースファイルへのベースパス。

source: cache/ – Stores data caches.
ja: cache/ – データキャッシュを格納します。

source: cacheMethod (see Configuration → Data Caching Config
ja: cacheMethod（コンフィギュレーション > データキャッシュ設定をみてください。

source: cacheMethod (see Configuration → Data Caching Config)
ja: cacheMethod （コンフィギュレーション > データキャッシュ設定を参照してください。）

source: changelogUrl – The plugin’s changelog URL (used to show pending plugin updates and their release notes).
ja: changelogUrl – プラグインの変更ログの URL（保留中のプラグインアップデートとリリースノートの表示に使用されます）。

source: class – The primary Plugin class name.
ja: class – プライマリプラグインクラス の名前。

source: clone the ElementCriteriaModel object
ja: ElementCriteriaModel オブジェクトを複製する

source: compiled_classes/ – Stores some dynamically-defined PHP classes.
ja: compiled_classes/ – いくつかの動的に定義された PHP クラスを格納します。

source: compiled_templates/ – Stores compiled Twig templates.
ja: compiled_templates/ – コンパイル済みのテンプレートを格納します。

source: components – Object defining any that should be present on the plugin.
ja: components – プラグイン上に存在するべき を定義するオブジェクト。

source: craft.assets(), craft.entries(), craft.tags(), and craft.users() support a search parameter that you can use to filter their elements by a given search query.
ja: craft.assets()、craft.entries()、craft.tags()、および craft.users()は、検索クエリを指定したエレメントの絞り込みに利用できる search パラメータをサポートしています。

source: craft.assets, craft.entries, craft.tags, and craft.users support a search parameter that you can use to filter their elements by a given search query.
ja: craft.assets、craft.entries、craft.tags、および craft.users は、検索クエリを指定したエレメントの絞り込みに利用できる search パラメータをサポートしています。

source: craft.session.returnUrl is set to the original URL that included the {% requireLogin %} tag that initiated the redirect to this login form.
ja: craft.session.returnUrl には、このログインフォームへリダイレクトした {% requireLogin %} タグを含む元の URL がセットされます。

source: craft/templates/recipes/ingredients/index.html, the template path recipes/ingredients will match ingredients.html.
ja: craft/templates/recipes/ingredients/index.html の両方にテンプレートがあれば、recipes/ingredients は ingredients.html と一致します。

source: custom site-specific translation messages
ja: サイト固有の翻訳メッセージ

source: day – Day of a month (1-31 or 01-31)
ja: day – 月の特定の日（1-31 または 01-31）

source: description – The plugin description.
ja: description – プラグインの説明。

source: developer – The developer name.
ja: developer – 開発者の名前。

source: developerEmail – The support email.
ja: developerEmail – サポートのメールアドレス。

source: developerUrl – The developer URL.
ja: developerUrl – 開発者の URL。

source: documentationUrl – The plugin’s documentation URL.
ja: documentationUrl – プラグインのドキュメントの URL。

source: downloadUrl – The plugin’s download URL (used to update manual installations of the plugin).
ja: downloadUrl – プラグインのダウンロード URL（プラグインのアップデートをマニュアルインストールで使用されます）。

source: element, sourceElement, or targetElement
ja: element, sourceElement、または targetElement

source: entry query param:
ja: エントリクエリパラメータに渡します。

source: format can be set to 'jpg', 'gif', 'png', or 'Auto'.
ja: format には、'jpg'、'gif'、'png'、または 'Auto' をセットできます。

source: handle – The plugin handle (required).
ja: handle – プラグインハンドル（必須）。

source: hasCpSection – Whether the plugin has its own section in the Control Panel (should be true or false).
ja: hasCpSection – コントロールパネルにプラグイン独自のセクションを持つかどうか（true または false）。

source: hasSettings – Whether the plugin has settings (should be true or false).
ja: hasSettings – プラグインの設定があるかどうか（true または false）。

source: https://developer-url.com with the URL to the website the developer name should link to in the Control Panel.
ja: https://developer-url.com をコントロールパネルの開発者名にリンクするウェブサイトの URL にします。

source: iOS: Safari 9.1 or later
ja: iOS: Safari 9.1 以降

source: iconv – Adds support for more character encodings than PHP’s built-in mb_convert_encoding() function, which Craft will take advantage of when converting strings to UTF-8.
ja: iconv – Craft が文字列を UTF-8 に変換する際に利用され、PHP にビルドインされている mb_convert_encoding() よりも多くの文字エンコーディングのサポートを追加します。

source: ids() (setting criteria params here is now deprecated)
ja: ids()（criteria パラメータは非推奨になりました）

source: last() was deprecated in Craft 3 because it isn’t clear that it needs to run two database queries behind the scenes (the equivalent of query.nth(query.count() - 1)).
ja: last() は Craft 3 で非推奨になりました。なぜなら、（query.nth(query.count() - 1) に相当する）2つのデータベースクエリを背後で実行する必要があることが明確ではないからです。

source: limit Param
ja: limit パラメータ

source: logs/ – Stores Craft’s logs and PHP error logs.
ja: logs/ – Craft のログや PHP エラーログを格納します。

source: markdown or md
ja: markdown または md

source: max() – Returns the maximum number of all the values in the first column
ja: max() – 最初のカラムのすべての値の最大値を返します

source: min() – Returns the minimum number of all the values in the first column
ja: min() – 最初のカラムのすべての値の最小値を返します

source: month – Numeric representation of a month (1-12 or 01-12)
ja: month – 月の数値表現（1-12 または 01-12）

source: mutex/ – Stores file lock data.
ja: mutex/ – ファイルロックデータを格納します。

source: name – The plugin name.
ja: name – プラグイン名。

source: ns\\prefix\\ with your namespace prefix.
ja: ns\\prefix\\ を名前空間接頭辞にします。

source: number – Any positive integer
ja: number – 任意の正の整数

source: omitScriptNameInUrls and usePathInfo
ja: omitScriptNameInUrls と usePathInfo

source: opposite of `':empty:'`)
ja: （`':empty:'` の反対）

source: ownerSite or ownerSiteId
ja: ownerSite または ownerSiteId

source: package/name with your package name.
ja: package/name をパッケージ名にします。

source: page – Any positive integer
ja: page – 任意の正の整数

source: pageEntries gets set to an array of the elements that belong to the current page.
ja: pageEntries には、現在のページに属するエレメントの配列がセットされます。

source: pageInfo gets set to a object, which provides info about the current page, and some helper methods for creating links to other pages (more details below).
ja: pageInfo には、現在のページに関する情報や他のページへのリンクを作成するためのいくつかのヘルパーメソッド（詳細は以下）を提供する オブジェクトがセットされます。

source: pageInfo gets set to a craft\web\twig\variables\Paginate object, which provides info about the current page, and some helper methods for creating links to other pages (more details below).
ja: pageInfo には、現在のページに関する情報や他のページへのリンクを作成するためのいくつかのヘルパーメソッド（詳細 は以下）を提供する craft\web\twig\variables\Paginate オブジェクトがセットされます。

source: plugin-handle with your plugin handle.
ja: plugin-handle をプラグインハンドルにします。

source: quality can be set to a number between 0 and 100, or omitted.
ja: quality は、0 から 100 の間の数値をセットするか、省略できます。

source: rebrand/ – Stores the custom Login Page Logo and Site Icon files, if you’ve uploaded them.
ja: rebrand/ – アップロードしてある場合、カスタムログインページのロゴとサイトアイコンファイルを格納します。

source: recipes
ja: レシピ

source: redirect Params
ja: redirect パラメータ

source: redirect params must be hashed now.
ja: redirect パラメータは、ハッシュ値に変換しなければなりません。

source: return the cloned object
ja: 複製したオブジェクトを返す

source: return the element query
ja: エレメントクエリを返す

source: runtime/ – Pretty much everything in here is there for caching and logging purposes.
ja: runtime/ – ここにあるすべては、おおよそキャッシングやロギングを目的とするものです。

source: schemaVersion – The plugin schema version.
ja: schemaVersion – プラグインスキーマのバージョン。

source: set the parameter value on the cloned object
ja: 複製したオブジェクトのパラメータ値を設定する

source: set the parameter value on the current element query
ja: 現在のエレメントクエリにパラメータ値を設定する

source: siteId or site
ja: siteId または site

source: siteId, site.handle, or site.language
ja: siteId、site.handle、または、site.language

source: slug – Any string of characters, except for a forward slash (/)
ja: slug – スラッシュ（/）を除く、任意の文字列

source: sourceLanguage – The plugin’s source language (defaults to en-US).
ja: sourceLanguage – プラグインのソース言語（デフォルトは en-US）。

source: sum() – Returns the sum of all the values in the first column
ja: sum() – 最初のカラムのすべての値の合計を返します

source: tag – Any string of characters, except for a forward slash (/)
ja: tag – スラッシュ（/）を除く、任意の文字列

source: temp/ – Stores temp files.
ja: temp/ – 一時ファイルを格納します。

source: the database connection settings.
ja: そのデータベースの接続設定を

source: the homepage
ja: ホームページ

source: they let you define the content tabs that contain the fields.
ja: それらはフィールドを含むコンテンツタブを定義できます。

source: translate or t
ja: translate または t

source: unless in a single {% cache %} tag.
ja: unless のいずれかを1つの {% cache %}タグで使用できます。

source: until in a single {% cache %} tag.
ja: until のいずれかを1つの {% cache %} タグで使用できます。

source: validation.key – A randomly-generated, cryptographically secure key that is used for hashing and validating data between requests.
ja: validation.key – リクエスト間のハッシングやデータ検証に使われる、ランダムに生成され、暗号化された安全な鍵です。

source: version - The plugin version.
ja: version - プラグインのバージョン。

source: when checking for Craft updates
ja: Craft のアップデートをチェックするとき

source: when loading RSS feeds from the Feeds widget
ja: Feed ウィジェットから RSS フィードを読み込むとき

source: when sending in a support request from the Craft Support widget
ja: Craft のサポートウィジェットからサポートリクエストを送信するとき

source: when the orderBy param contains a object
ja: orderBy パラメータに オブジェクトが含まれている場合

source: when the orderBy param contains a `yii\db\Expression` object
ja: orderBy パラメータに `yii\db\Expression` オブジェクトが含まれている場合

source: when there is no ORDER BY clause in the SQL, therefore nothing to reverse
ja: SQL に ORDER BY 句が存在しない場合、反転できるものがありません

source: when working with assets on remote volumes, like Amazon S3
ja: Amazon S3 のようなリモートボリュームにあるアセットを操作するとき

source: where your template name would be, for example, _share/footer-de.
ja: この例では、読み込まれるテンプレート名は _share/footer-de になります。

source: width and height can be set to integers or omitted.
ja: width と height は、整数をセットするか、省略できます。

source: year – Four consecutive digits
ja: year – 4桁の連続する数字

source: you've installed Composer (see step 1 of the installation instructions)
ja: Composer をインストールしてあります。（インストールガイドのステップ1を参照）

source: you've reviewed the changes in Craft 3
ja: あなたはCraft 3 の変更点を確認しました。

source: you@example.com with your support email.
ja: you@example.com をサポートのメールアドレスにします。

source: your database is backed up in case everything goes horribly wrong
ja: なんらかの問題が起こった場合に備えて、データベースをバックアップしてあります。

source: your plugins are all up-to-date, and you’ve verified that they’ve been updated for Craft 3 (you can see a report of your plugins’ Craft 3 compatibility status from the Updates page in the Craft 2 Control Panel)
ja: プラグインはすべて最新の状態で、それらが Craft 3 向けにアップデートされていることを確かめました。（Craft 2 コントロールパネルのアップデートページから、プラグインの Craft 3 互換ステータスのレポートを見ることができます。）

source: your server meets Craft 3’s **minimum requirements** (Craft 3 requires PHP 7+ and at least 256 MB of memory allocated to PHP)
ja: あなたのサーバーは Craft 3 の**最小要件**（Craft 3 には PHP 7 以降が必要で、 PHP 割当メモリが少なくとも 256MB 必要です）を満たしています。

source: your server meets Craft 3’s minimum requirements (Craft 3 requires PHP 7+ and at least 256 MB of memory allocated to PHP)
ja: あなたのサーバーは Craft 3 の最小要件（Craft 3 には PHP 7 以降が必要で、PHP 割当メモリが少なくとも 256 MB 必要です）を満たしています。

source: your site is running at least Craft 2.6.2788
ja: あなたのサイトは、少なくとも Craft 2.6.2788 が実行されています。

source: {asset:123:filename} – returns the filename of an asset with the ID of 123 (via ).
ja: {asset:123:filename} – ID が 123 のアセットのファイル名を（ 経由で）返します。
